## Installation

In [ ]:
pip install PyMySql

In [ ]:
pip install mysql-connector

In [1]:
import mysql.connector

## Creating SQL connection and connect

In [2]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="*******"
)

print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000028544B2FBB0>

In [3]:
cursor = mydb.cursor()

cursor.execute("SHOW DATABASES")

In [4]:
for x in cursor:
    print(x)

('abcd',)
('attrition',)
('cars',)
('demo1',)
('fake',)
('indian_cars',)
('information_schema',)
('ipl',)
('joins',)
('mydb',)
('mysql',)
('performance_schema',)
('practice',)
('sakila',)
('students',)
('sys',)
('world',)

In [5]:
cursor.execute("USE students")

In [6]:
cursor.execute("show tables")

In [7]:
for x in cursor:
    print(x)

('student',)
('students1',)

In [8]:
cursor.execute("SELECT * FROM students1")

In [9]:
for x in cursor:
    print(x)

(1, 'sanket', 'stat', 'A')
(2, 'shrya', 'mvs', 'B')
(3, 'vijay', 'infarence', 'C')
(4, 'akash', 'maths', 'c')
(5, 'akshay', 'hindi', 'B')
(6, 'viraj', 'marathi', 'B')
(9, 'Aakash', 'stat', 'A')
(10, 'Prakash', 'physics', 'A')
(11, 'Aakash', 'physics', 'A')
(12, 'Aakash', 'physics', 'A')
(13, 'Aakash', 'physics', 'A')

## Insert Records in Table

In [10]:
query = "INSERT INTO students1 (name,sub,grade) VALUES (%s,%s,%s)"
values = ("Aakash","physics","A")
cursor.execute(query,values)
print("Row inserted",cursor.lastrowid)

Row inserted 14

In [11]:
### Insert multiple records in Table
query = "INSERT INTO student (name, sub,grade) VALUES (%s,%s, %s)"
values = [("shivani", "Stat","A"),
        ("Joe", "maths","B"),
        ("Ankur","math","B"),
        ("Paul","eng","A"),
        ("Vishal","Maths","B"),
        ("Krish","stat","A")]
cursor.executemany(query,values)
print("Row inserted",cursor.lastrowid)

Row inserted 31

#### Select All

In [12]:
cursor = mydb.cursor()
cursor.execute("select*from student")

In [13]:
cursor.fetchall()

[(1, 'ram', 'eng', 'A'),
 (2, 'sham', 'hindi', 'A'),
 (3, 'som', 'hindi', 'A'),
 (4, 'ravi', 'marathi', 'B'),
 (5, 'dipak', 'hindi', 'A'),
 (6, 'mahesh', 'maths', 'C'),
 (7, 'shivani', 'Stat', 'A'),
 (8, 'Joe', 'maths', 'B'),
 (9, 'Ankur', 'maths', 'B'),
 (10, 'Paul', 'eng', 'A'),
 (11, 'Vishal', 'Maths', 'B'),
 (12, 'Krish', 'stat', 'A'),
 (13, 'shivani', 'Stat', 'A'),
 (14, 'Joe', 'maths', 'B'),
 (15, 'Ankur', 'math', 'B'),
 (16, 'Paul', 'eng', 'A'),
 (17, 'Vishal', 'Maths', 'B'),
 (18, 'Krish', 'stat', 'A'),
 (19, 'shivani', 'Stat', 'A'),
 (20, 'Joe', 'maths', 'B'),
 (21, 'Ankur', 'math', 'B'),
 (22, 'Paul', 'eng', 'A'),
 (23, 'Vishal', 'Maths', 'B'),
 (24, 'Krish', 'stat', 'A'),
 (25, 'shivani', 'Stat', 'A'),
 (26, 'Joe', 'maths', 'B'),
 (27, 'Ankur', 'math', 'B'),
 (28, 'Paul', 'eng', 'A'),
 (29, 'Vishal', 'Maths', 'B'),
 (30, 'Krish', 'stat', 'A'),
 (31, 'shivani', 'Stat', 'A'),
 (32, 'Joe', 'maths', 'B'),
 (33, 'Ankur', 'math', 'B'),
 (34, 'Paul', 'eng', 'A'),
 (35, 'Vishal', 'Maths', 'B'),
 (36, 'Krish', 'stat', 'A')]

### We can update existing records in a table by using the "UPDATE" statement:

In [14]:
query="UPDATE students1 SET name = 'Prakash' WHERE roll_no = '10'"
cursor.execute(query)
mydb.commit()
print(cursor.rowcount, "record(s) affected")

0 record(s) affected

In [15]:
query="UPDATE student SET sub = 'maths' WHERE roll_no = '9'"
cursor.execute(query)
mydb.commit()
print(cursor.rowcount, "record(s) affected")

0 record(s) affected

In [16]:
cursor = mydb.cursor()
#cursor.execute("select*from students1")
cursor.execute("select*from student")

In [17]:
#cursor.fetchall()

### Select Perticular Row

In [21]:
cursor.execute("select * from students1 where name = 'Aakash'")

In [22]:
cursor.fetchall()

[(9, 'Aakash', 'stat', 'A'),
 (11, 'Aakash', 'physics', 'A'),
 (12, 'Aakash', 'physics', 'A'),
 (13, 'Aakash', 'physics', 'A'),
 (14, 'Aakash', 'physics', 'A')]

## select distinct column

In [23]:
cursor.execute("select name,sub from students1 where name='Aakash' or sub = 'maths'")
cursor.fetchall()

[('akash', 'maths'),
 ('Aakash', 'stat'),
 ('Aakash', 'physics'),
 ('Aakash', 'physics'),
 ('Aakash', 'physics'),
 ('Aakash', 'physics')]

## select another database

In [24]:
mydb.cursor()
cursor.execute("show databases")

In [25]:
for x in cursor:
    print(x)

('abcd',)
('attrition',)
('cars',)
('demo1',)
('fake',)
('indian_cars',)
('information_schema',)
('ipl',)
('joins',)
('mydb',)
('mysql',)
('performance_schema',)
('practice',)
('sakila',)
('students',)
('sys',)
('world',)

In [26]:
cursor.execute("use indian_cars")

In [27]:
cursor.execute("show tables")

In [28]:
cursor.fetchall()

[('honda',), ('hyundai',)]

In [29]:
cursor.execute("select * from Honda")

In [30]:
cursor.fetchall()

[(1, 'hatchback', 5, 'petrol', 'brio'),
 (2, 'suv', 5, 'petrol & Diesel', 'CR-V'),
 (3, 'Sedan', 5, 'petrol & Diesel', 'Civic'),
 (4, 'suv', 5, 'petrol & Diesel', 'BR-V'),
 (5, 'Sedan', 5, 'petrol & Diesel', 'City')]

### Alter function

In [31]:
#Add column
cursor.execute("alter table Honda add air_bag int(10)")

In [32]:
cursor.execute("select * from Honda")

In [33]:
cursor.fetchall()

[(1, 'hatchback', 5, 'petrol', 'brio', None),
 (2, 'suv', 5, 'petrol & Diesel', 'CR-V', None),
 (3, 'Sedan', 5, 'petrol & Diesel', 'Civic', None),
 (4, 'suv', 5, 'petrol & Diesel', 'BR-V', None),
 (5, 'Sedan', 5, 'petrol & Diesel', 'City', None)]

#### none values represents air_bag column

In [34]:
#rename column
cursor.execute("ALTER TABLE Honda RENAME COLUMN air_bag TO engine")

In [35]:
cursor.execute("select * from Honda")

In [36]:
cursor.fetchall()

[(1, 'hatchback', 5, 'petrol', 'brio', None),
 (2, 'suv', 5, 'petrol & Diesel', 'CR-V', None),
 (3, 'Sedan', 5, 'petrol & Diesel', 'Civic', None),
 (4, 'suv', 5, 'petrol & Diesel', 'BR-V', None),
 (5, 'Sedan', 5, 'petrol & Diesel', 'City', None)]

#### none values represents engine column

In [37]:
#drop column
cursor.execute("alter table Honda drop engine")

In [38]:
cursor.execute("select * from Honda")

In [39]:
cursor.fetchall()

[(1, 'hatchback', 5, 'petrol', 'brio'),
 (2, 'suv', 5, 'petrol & Diesel', 'CR-V'),
 (3, 'Sedan', 5, 'petrol & Diesel', 'Civic'),
 (4, 'suv', 5, 'petrol & Diesel', 'BR-V'),
 (5, 'Sedan', 5, 'petrol & Diesel', 'City')]

### SQL Count Min, Max, Sum, Avrage Functions

In [40]:
cursor.execute("show databases")

In [41]:
for x in cursor:
    print(x)

('abcd',)
('attrition',)
('cars',)
('demo1',)
('fake',)
('indian_cars',)
('information_schema',)
('ipl',)
('joins',)
('mydb',)
('mysql',)
('performance_schema',)
('practice',)
('sakila',)
('students',)
('sys',)
('world',)

In [42]:
cursor.execute("use attrition")

In [43]:
cursor.execute("show tables")

In [44]:
cursor.fetchall()

[('attrition01',), ('table1',), ('table2',)]

In [45]:
cursor.execute("select * from attrition01")

In [47]:
#cursor.fetchall()

In [48]:
#The COUNT() function returns the number of rows that matches a specified criterion.
cursor.execute("select count(MonthlyIncome) from attrition01")

In [49]:
cursor.fetchall()

[(48,)]

In [50]:
#The SUM() function returns the total sum of a numeric column. 
cursor.execute("select SUM(MonthlyIncome) from attrition01")

In [51]:
cursor.fetchall()

[(Decimal('190674'),)]

In [52]:
#The MIN() function returns the smallest value of the selected column.
cursor.execute("select min(MonthlyIncome) from attrition01")

In [53]:
cursor.fetchall()

[(1232,)]

In [54]:
#The MAX() function returns the largest value of the selected column.
cursor.execute("select max(MonthlyIncome) from attrition01")

In [55]:
cursor.fetchall()

[(10248,)]

In [56]:
#The AVG() function returns the average value of a numeric column. 
cursor.execute("select avg(MonthlyIncome) from attrition01")

In [57]:
cursor.fetchall()

[(Decimal('3972.3750'),)]